*> Problems with COPY statements.
COPY NOSUCH.
COPY "../secret.cpy".
COPY "/etc/passwd".
COPY.
COPY PAYREC REPLACING ==A== .
COPY PAYREC
01  STILL-HERE PIC X.
