//PAYBKUP  PROC
//COPY     EXEC PGM=IEBGENER
//SYSUT1   DD DSN=PROD.PAYROLL.MASTER,DISP=SHR
//SYSUT2   DD DSN=PROD.PAYROLL.BACKUP,DISP=(MOD,KEEP)
//SYSIN    DD DUMMY
//SYSPRINT DD SYSOUT=*
