      * Nothing for plumbline fix to do.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. CLEAN.
       PROCEDURE DIVISION.
           DISPLAY "CLEAN"
           STOP RUN.
