*> SEND and RECEIVE MAP against the maps of screens.bms: literals, a
*> constant data item, a name set at run time, and a mapset outside
*> the run.
IDENTIFICATION DIVISION.
PROGRAM-ID. SCREENS.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  THIS-MAP           PIC X(8) VALUE "SCRMAP".
01  THIS-MAPSET        PIC X(8) VALUE "SCRSET".
01  HELP-MAP           PIC X(8) VALUE "HELPMAP".
01  NEXT-MAP           PIC X(8) VALUE "SCRMAP".
01  WS-RESP            PIC S9(8) COMP.
PROCEDURE DIVISION.
    EXEC CICS SEND MAP('SCRMAP') MAPSET('SCRSET') ERASE
        RESP(WS-RESP)
    END-EXEC
    EXEC CICS RECEIVE MAP(THIS-MAP) MAPSET(THIS-MAPSET)
        RESP(WS-RESP)
    END-EXEC
    EXEC CICS SEND MAP(HELP-MAP) MAPSET('SCRSET')
        RESP(WS-RESP)
    END-EXEC
    MOVE "SMALL" TO NEXT-MAP
    EXEC CICS SEND MAP(NEXT-MAP) MAPSET(THIS-MAPSET)
        RESP(WS-RESP)
    END-EXEC
    EXEC CICS SEND MAP('ORDMAP') MAPSET('ORDSET')
        RESP(WS-RESP)
    END-EXEC
    EXEC CICS SEND MAP('SCRSET') RESP(WS-RESP) END-EXEC
    EXEC CICS RETURN END-EXEC.
