    EXEC SQL DECLARE CUSTOMER TABLE
        ( ID CHAR(8) NOT NULL, NAME CHAR(30) NOT NULL )
    END-EXEC.
01  DCL-CUSTOMER.
    10 CUST-ID          PIC X(8).
    10 CUST-NAME        PIC X(30).
