*> The files of a program and the DD names they need: a name, the last
*> part of an IBM assignment name, OPTIONAL, a sort file, and files
*> assigned to a data item or a path, which name no DD.
IDENTIFICATION DIVISION.
PROGRAM-ID. FILES.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT MASTER ASSIGN TO MASTERIN.
    SELECT OPTIONAL CONTROLS ASSIGN TO UT-S-CONTROLS.
    SELECT REPORT-OUT ASSIGN 'REPORT1'.
    SELECT WORK-FILE ASSIGN TO SORTWK1.
    SELECT LOG-FILE ASSIGN TO LOG-PATH.
    SELECT LOCAL-FILE ASSIGN TO "data/local.dat".
DATA DIVISION.
FILE SECTION.
FD  MASTER.
01  MASTER-REC         PIC X(80).
FD  CONTROLS.
01  CONTROL-REC        PIC X(80).
FD  REPORT-OUT.
01  REPORT-REC         PIC X(132).
SD  WORK-FILE.
01  WORK-REC           PIC X(80).
FD  LOG-FILE.
01  LOG-REC            PIC X(80).
FD  LOCAL-FILE.
01  LOCAL-REC          PIC X(80).
WORKING-STORAGE SECTION.
01  LOG-PATH           PIC X(60) VALUE "run.log".
PROCEDURE DIVISION.
    OPEN INPUT MASTER CONTROLS
         OUTPUT REPORT-OUT
    OPEN EXTEND LOG-FILE
    OPEN I-O LOCAL-FILE
    CLOSE MASTER CONTROLS REPORT-OUT LOG-FILE LOCAL-FILE
    GOBACK.
