*> plbkwtab.cpy: COBOL reserved words, in ascending order for SEARCH ALL.
*>
*> Kinds:  V  verb that starts a statement
*>         T  explicit scope terminator (END-IF, END-PERFORM, ...)
*>         F  figurative constant (ZERO, SPACES, HIGH-VALUE, ...)
*>         S  special register (RETURN-CODE, TALLY, ...)
*>         R  any other reserved word
*>
*> The list covers the reserved words of the 2014 standard that matter
*> to analysis, plus common GnuCOBOL and IBM extensions. It must stay
*> sorted: tests/unit/test-plbkw.cob checks the order.
78  KW-COUNT                    VALUE 453.
01  WS-KEYWORD-VALUES.
    05  FILLER PIC X(32) VALUE "ACCEPT                         V".
    05  FILLER PIC X(32) VALUE "ACCESS                         R".
    05  FILLER PIC X(32) VALUE "ACTIVE-CLASS                   R".
    05  FILLER PIC X(32) VALUE "ADD                            V".
    05  FILLER PIC X(32) VALUE "ADDRESS                        R".
    05  FILLER PIC X(32) VALUE "ADVANCING                      R".
    05  FILLER PIC X(32) VALUE "AFTER                          R".
    05  FILLER PIC X(32) VALUE "ALIGNED                        R".
    05  FILLER PIC X(32) VALUE "ALL                            R".
    05  FILLER PIC X(32) VALUE "ALLOCATE                       V".
    05  FILLER PIC X(32) VALUE "ALPHABET                       R".
    05  FILLER PIC X(32) VALUE "ALPHABETIC                     R".
    05  FILLER PIC X(32) VALUE "ALPHABETIC-LOWER               R".
    05  FILLER PIC X(32) VALUE "ALPHABETIC-UPPER               R".
    05  FILLER PIC X(32) VALUE "ALPHANUMERIC                   R".
    05  FILLER PIC X(32) VALUE "ALPHANUMERIC-EDITED            R".
    05  FILLER PIC X(32) VALUE "ALSO                           R".
    05  FILLER PIC X(32) VALUE "ALTER                          V".
    05  FILLER PIC X(32) VALUE "ALTERNATE                      R".
    05  FILLER PIC X(32) VALUE "AND                            R".
    05  FILLER PIC X(32) VALUE "ANY                            R".
    05  FILLER PIC X(32) VALUE "ANYCASE                        R".
    05  FILLER PIC X(32) VALUE "ARE                            R".
    05  FILLER PIC X(32) VALUE "AREA                           R".
    05  FILLER PIC X(32) VALUE "AREAS                          R".
    05  FILLER PIC X(32) VALUE "ARGUMENT-NUMBER                R".
    05  FILLER PIC X(32) VALUE "ARGUMENT-VALUE                 R".
    05  FILLER PIC X(32) VALUE "AS                             R".
    05  FILLER PIC X(32) VALUE "ASCENDING                      R".
    05  FILLER PIC X(32) VALUE "ASSIGN                         R".
    05  FILLER PIC X(32) VALUE "AT                             R".
    05  FILLER PIC X(32) VALUE "AUTHOR                         R".
    05  FILLER PIC X(32) VALUE "B-AND                          R".
    05  FILLER PIC X(32) VALUE "B-NOT                          R".
    05  FILLER PIC X(32) VALUE "B-OR                           R".
    05  FILLER PIC X(32) VALUE "B-XOR                          R".
    05  FILLER PIC X(32) VALUE "BASED                          R".
    05  FILLER PIC X(32) VALUE "BEFORE                         R".
    05  FILLER PIC X(32) VALUE "BINARY                         R".
    05  FILLER PIC X(32) VALUE "BINARY-CHAR                    R".
    05  FILLER PIC X(32) VALUE "BINARY-DOUBLE                  R".
    05  FILLER PIC X(32) VALUE "BINARY-LONG                    R".
    05  FILLER PIC X(32) VALUE "BINARY-SHORT                   R".
    05  FILLER PIC X(32) VALUE "BIT                            R".
    05  FILLER PIC X(32) VALUE "BLANK                          R".
    05  FILLER PIC X(32) VALUE "BLOCK                          R".
    05  FILLER PIC X(32) VALUE "BOOLEAN                        R".
    05  FILLER PIC X(32) VALUE "BOTTOM                         R".
    05  FILLER PIC X(32) VALUE "BY                             R".
    05  FILLER PIC X(32) VALUE "CALL                           V".
    05  FILLER PIC X(32) VALUE "CANCEL                         V".
    05  FILLER PIC X(32) VALUE "CD                             R".
    05  FILLER PIC X(32) VALUE "CF                             R".
    05  FILLER PIC X(32) VALUE "CH                             R".
    05  FILLER PIC X(32) VALUE "CHARACTER                      R".
    05  FILLER PIC X(32) VALUE "CHARACTERS                     R".
    05  FILLER PIC X(32) VALUE "CLASS                          R".
    05  FILLER PIC X(32) VALUE "CLASS-ID                       R".
    05  FILLER PIC X(32) VALUE "CLOSE                          V".
    05  FILLER PIC X(32) VALUE "CODE                           R".
    05  FILLER PIC X(32) VALUE "CODE-SET                       R".
    05  FILLER PIC X(32) VALUE "COL                            R".
    05  FILLER PIC X(32) VALUE "COLLATING                      R".
    05  FILLER PIC X(32) VALUE "COLS                           R".
    05  FILLER PIC X(32) VALUE "COLUMN                         R".
    05  FILLER PIC X(32) VALUE "COLUMNS                        R".
    05  FILLER PIC X(32) VALUE "COMMA                          R".
    05  FILLER PIC X(32) VALUE "COMMAND-LINE                   R".
    05  FILLER PIC X(32) VALUE "COMMIT                         V".
    05  FILLER PIC X(32) VALUE "COMMON                         R".
    05  FILLER PIC X(32) VALUE "COMMUNICATION                  R".
    05  FILLER PIC X(32) VALUE "COMP                           R".
    05  FILLER PIC X(32) VALUE "COMP-1                         R".
    05  FILLER PIC X(32) VALUE "COMP-2                         R".
    05  FILLER PIC X(32) VALUE "COMP-3                         R".
    05  FILLER PIC X(32) VALUE "COMP-4                         R".
    05  FILLER PIC X(32) VALUE "COMP-5                         R".
    05  FILLER PIC X(32) VALUE "COMP-X                         R".
    05  FILLER PIC X(32) VALUE "COMPUTATIONAL                  R".
    05  FILLER PIC X(32) VALUE "COMPUTATIONAL-1                R".
    05  FILLER PIC X(32) VALUE "COMPUTATIONAL-2                R".
    05  FILLER PIC X(32) VALUE "COMPUTATIONAL-3                R".
    05  FILLER PIC X(32) VALUE "COMPUTATIONAL-4                R".
    05  FILLER PIC X(32) VALUE "COMPUTATIONAL-5                R".
    05  FILLER PIC X(32) VALUE "COMPUTATIONAL-X                R".
    05  FILLER PIC X(32) VALUE "COMPUTE                        V".
    05  FILLER PIC X(32) VALUE "CONDITION                      R".
    05  FILLER PIC X(32) VALUE "CONFIGURATION                  R".
    05  FILLER PIC X(32) VALUE "CONSTANT                       R".
    05  FILLER PIC X(32) VALUE "CONTAINS                       R".
    05  FILLER PIC X(32) VALUE "CONTENT                        R".
    05  FILLER PIC X(32) VALUE "CONTINUE                       V".
    05  FILLER PIC X(32) VALUE "CONTROL                        R".
    05  FILLER PIC X(32) VALUE "CONTROLS                       R".
    05  FILLER PIC X(32) VALUE "CONVERTING                     R".
    05  FILLER PIC X(32) VALUE "COPY                           R".
    05  FILLER PIC X(32) VALUE "CORR                           R".
    05  FILLER PIC X(32) VALUE "CORRESPONDING                  R".
    05  FILLER PIC X(32) VALUE "COUNT                          R".
    05  FILLER PIC X(32) VALUE "CRT                            R".
    05  FILLER PIC X(32) VALUE "CURRENCY                       R".
    05  FILLER PIC X(32) VALUE "CURSOR                         R".
    05  FILLER PIC X(32) VALUE "CYCLE                          R".
    05  FILLER PIC X(32) VALUE "DATA                           R".
    05  FILLER PIC X(32) VALUE "DATA-POINTER                   R".
    05  FILLER PIC X(32) VALUE "DATE                           R".
    05  FILLER PIC X(32) VALUE "DATE-COMPILED                  R".
    05  FILLER PIC X(32) VALUE "DATE-WRITTEN                   R".
    05  FILLER PIC X(32) VALUE "DAY                            R".
    05  FILLER PIC X(32) VALUE "DAY-OF-WEEK                    R".
    05  FILLER PIC X(32) VALUE "DE                             R".
    05  FILLER PIC X(32) VALUE "DEBUG-CONTENTS                 S".
    05  FILLER PIC X(32) VALUE "DEBUG-ITEM                     S".
    05  FILLER PIC X(32) VALUE "DEBUG-LINE                     S".
    05  FILLER PIC X(32) VALUE "DEBUG-NAME                     S".
    05  FILLER PIC X(32) VALUE "DEBUG-SUB-1                    S".
    05  FILLER PIC X(32) VALUE "DEBUG-SUB-2                    S".
    05  FILLER PIC X(32) VALUE "DEBUG-SUB-3                    S".
    05  FILLER PIC X(32) VALUE "DEBUGGING                      R".
    05  FILLER PIC X(32) VALUE "DECIMAL-POINT                  R".
    05  FILLER PIC X(32) VALUE "DECLARATIVES                   R".
    05  FILLER PIC X(32) VALUE "DEFAULT                        R".
    05  FILLER PIC X(32) VALUE "DELETE                         V".
    05  FILLER PIC X(32) VALUE "DELIMITED                      R".
    05  FILLER PIC X(32) VALUE "DELIMITER                      R".
    05  FILLER PIC X(32) VALUE "DEPENDING                      R".
    05  FILLER PIC X(32) VALUE "DESCENDING                     R".
    05  FILLER PIC X(32) VALUE "DESTINATION                    R".
    05  FILLER PIC X(32) VALUE "DETAIL                         R".
    05  FILLER PIC X(32) VALUE "DISABLE                        V".
    05  FILLER PIC X(32) VALUE "DISPLAY                        V".
    05  FILLER PIC X(32) VALUE "DIVIDE                         V".
    05  FILLER PIC X(32) VALUE "DIVISION                       R".
    05  FILLER PIC X(32) VALUE "DOWN                           R".
    05  FILLER PIC X(32) VALUE "DUPLICATES                     R".
    05  FILLER PIC X(32) VALUE "DYNAMIC                        R".
    05  FILLER PIC X(32) VALUE "EC                             R".
    05  FILLER PIC X(32) VALUE "EGI                            R".
    05  FILLER PIC X(32) VALUE "ELSE                           R".
    05  FILLER PIC X(32) VALUE "EMI                            R".
    05  FILLER PIC X(32) VALUE "ENABLE                         V".
    05  FILLER PIC X(32) VALUE "END                            R".
    05  FILLER PIC X(32) VALUE "END-ACCEPT                     T".
    05  FILLER PIC X(32) VALUE "END-ADD                        T".
    05  FILLER PIC X(32) VALUE "END-CALL                       T".
    05  FILLER PIC X(32) VALUE "END-COMPUTE                    T".
    05  FILLER PIC X(32) VALUE "END-DELETE                     T".
    05  FILLER PIC X(32) VALUE "END-DISPLAY                    T".
    05  FILLER PIC X(32) VALUE "END-DIVIDE                     T".
    05  FILLER PIC X(32) VALUE "END-EVALUATE                   T".
    05  FILLER PIC X(32) VALUE "END-EXEC                       T".
    05  FILLER PIC X(32) VALUE "END-IF                         T".
    05  FILLER PIC X(32) VALUE "END-JSON                       T".
    05  FILLER PIC X(32) VALUE "END-MULTIPLY                   T".
    05  FILLER PIC X(32) VALUE "END-OF-PAGE                    R".
    05  FILLER PIC X(32) VALUE "END-PERFORM                    T".
    05  FILLER PIC X(32) VALUE "END-READ                       T".
    05  FILLER PIC X(32) VALUE "END-RECEIVE                    T".
    05  FILLER PIC X(32) VALUE "END-RETURN                     T".
    05  FILLER PIC X(32) VALUE "END-REWRITE                    T".
    05  FILLER PIC X(32) VALUE "END-SEARCH                     T".
    05  FILLER PIC X(32) VALUE "END-START                      T".
    05  FILLER PIC X(32) VALUE "END-STRING                     T".
    05  FILLER PIC X(32) VALUE "END-SUBTRACT                   T".
    05  FILLER PIC X(32) VALUE "END-UNSTRING                   T".
    05  FILLER PIC X(32) VALUE "END-WRITE                      T".
    05  FILLER PIC X(32) VALUE "END-XML                        T".
    05  FILLER PIC X(32) VALUE "ENTRY                          V".
    05  FILLER PIC X(32) VALUE "ENVIRONMENT                    R".
    05  FILLER PIC X(32) VALUE "ENVIRONMENT-NAME               R".
    05  FILLER PIC X(32) VALUE "ENVIRONMENT-VALUE              R".
    05  FILLER PIC X(32) VALUE "EO                             R".
    05  FILLER PIC X(32) VALUE "EOP                            R".
    05  FILLER PIC X(32) VALUE "EQUAL                          R".
    05  FILLER PIC X(32) VALUE "ERROR                          R".
    05  FILLER PIC X(32) VALUE "ESI                            R".
    05  FILLER PIC X(32) VALUE "EVALUATE                       V".
    05  FILLER PIC X(32) VALUE "EVERY                          R".
    05  FILLER PIC X(32) VALUE "EXAMINE                        V".
    05  FILLER PIC X(32) VALUE "EXCEPTION                      R".
    05  FILLER PIC X(32) VALUE "EXCEPTION-OBJECT               R".
    05  FILLER PIC X(32) VALUE "EXEC                           V".
    05  FILLER PIC X(32) VALUE "EXHIBIT                        V".
    05  FILLER PIC X(32) VALUE "EXIT                           V".
    05  FILLER PIC X(32) VALUE "EXTEND                         R".
    05  FILLER PIC X(32) VALUE "EXTERNAL                       R".
    05  FILLER PIC X(32) VALUE "FACTORY                        R".
    05  FILLER PIC X(32) VALUE "FALSE                          R".
    05  FILLER PIC X(32) VALUE "FD                             R".
    05  FILLER PIC X(32) VALUE "FILE                           R".
    05  FILLER PIC X(32) VALUE "FILE-CONTROL                   R".
    05  FILLER PIC X(32) VALUE "FILLER                         R".
    05  FILLER PIC X(32) VALUE "FINAL                          R".
    05  FILLER PIC X(32) VALUE "FIRST                          R".
    05  FILLER PIC X(32) VALUE "FOOTING                        R".
    05  FILLER PIC X(32) VALUE "FOR                            R".
    05  FILLER PIC X(32) VALUE "FORMAT                         R".
    05  FILLER PIC X(32) VALUE "FREE                           V".
    05  FILLER PIC X(32) VALUE "FROM                           R".
    05  FILLER PIC X(32) VALUE "FUNCTION                       R".
    05  FILLER PIC X(32) VALUE "FUNCTION-ID                    R".
    05  FILLER PIC X(32) VALUE "GENERATE                       V".
    05  FILLER PIC X(32) VALUE "GET                            R".
    05  FILLER PIC X(32) VALUE "GIVING                         R".
    05  FILLER PIC X(32) VALUE "GLOBAL                         R".
    05  FILLER PIC X(32) VALUE "GO                             V".
    05  FILLER PIC X(32) VALUE "GOBACK                         V".
    05  FILLER PIC X(32) VALUE "GREATER                        R".
    05  FILLER PIC X(32) VALUE "GROUP                          R".
    05  FILLER PIC X(32) VALUE "GROUP-USAGE                    R".
    05  FILLER PIC X(32) VALUE "HEADING                        R".
    05  FILLER PIC X(32) VALUE "HIGH-VALUE                     F".
    05  FILLER PIC X(32) VALUE "HIGH-VALUES                    F".
    05  FILLER PIC X(32) VALUE "I-O                            R".
    05  FILLER PIC X(32) VALUE "I-O-CONTROL                    R".
    05  FILLER PIC X(32) VALUE "IDENTIFICATION                 R".
    05  FILLER PIC X(32) VALUE "IF                             V".
    05  FILLER PIC X(32) VALUE "IN                             R".
    05  FILLER PIC X(32) VALUE "INDEX                          R".
    05  FILLER PIC X(32) VALUE "INDEXED                        R".
    05  FILLER PIC X(32) VALUE "INDICATE                       R".
    05  FILLER PIC X(32) VALUE "INHERITS                       R".
    05  FILLER PIC X(32) VALUE "INITIAL                        R".
    05  FILLER PIC X(32) VALUE "INITIALIZE                     V".
    05  FILLER PIC X(32) VALUE "INITIALIZED                    R".
    05  FILLER PIC X(32) VALUE "INITIATE                       V".
    05  FILLER PIC X(32) VALUE "INPUT                          R".
    05  FILLER PIC X(32) VALUE "INPUT-OUTPUT                   R".
    05  FILLER PIC X(32) VALUE "INSPECT                        V".
    05  FILLER PIC X(32) VALUE "INSTALLATION                   R".
    05  FILLER PIC X(32) VALUE "INTERFACE                      R".
    05  FILLER PIC X(32) VALUE "INTERFACE-ID                   R".
    05  FILLER PIC X(32) VALUE "INTO                           R".
    05  FILLER PIC X(32) VALUE "INTRINSIC                      R".
    05  FILLER PIC X(32) VALUE "INVALID                        R".
    05  FILLER PIC X(32) VALUE "INVOKE                         V".
    05  FILLER PIC X(32) VALUE "IS                             R".
    05  FILLER PIC X(32) VALUE "JSON                           V".
    05  FILLER PIC X(32) VALUE "JUST                           R".
    05  FILLER PIC X(32) VALUE "JUSTIFIED                      R".
    05  FILLER PIC X(32) VALUE "KEY                            R".
    05  FILLER PIC X(32) VALUE "LAST                           R".
    05  FILLER PIC X(32) VALUE "LEADING                        R".
    05  FILLER PIC X(32) VALUE "LEFT                           R".
    05  FILLER PIC X(32) VALUE "LENGTH                         R".
    05  FILLER PIC X(32) VALUE "LESS                           R".
    05  FILLER PIC X(32) VALUE "LIMIT                          R".
    05  FILLER PIC X(32) VALUE "LIMITS                         R".
    05  FILLER PIC X(32) VALUE "LINAGE                         R".
    05  FILLER PIC X(32) VALUE "LINAGE-COUNTER                 R".
    05  FILLER PIC X(32) VALUE "LINE                           R".
    05  FILLER PIC X(32) VALUE "LINE-COUNTER                   R".
    05  FILLER PIC X(32) VALUE "LINES                          R".
    05  FILLER PIC X(32) VALUE "LINKAGE                        R".
    05  FILLER PIC X(32) VALUE "LOCAL-STORAGE                  R".
    05  FILLER PIC X(32) VALUE "LOCALE                         R".
    05  FILLER PIC X(32) VALUE "LOCK                           R".
    05  FILLER PIC X(32) VALUE "LOW-VALUE                      F".
    05  FILLER PIC X(32) VALUE "LOW-VALUES                     F".
    05  FILLER PIC X(32) VALUE "MERGE                          V".
    05  FILLER PIC X(32) VALUE "MESSAGE                        R".
    05  FILLER PIC X(32) VALUE "METHOD                         R".
    05  FILLER PIC X(32) VALUE "METHOD-ID                      R".
    05  FILLER PIC X(32) VALUE "MINUS                          R".
    05  FILLER PIC X(32) VALUE "MODE                           R".
    05  FILLER PIC X(32) VALUE "MOVE                           V".
    05  FILLER PIC X(32) VALUE "MULTIPLE                       R".
    05  FILLER PIC X(32) VALUE "MULTIPLY                       V".
    05  FILLER PIC X(32) VALUE "NATIONAL                       R".
    05  FILLER PIC X(32) VALUE "NATIONAL-EDITED                R".
    05  FILLER PIC X(32) VALUE "NATIVE                         R".
    05  FILLER PIC X(32) VALUE "NEGATIVE                       R".
    05  FILLER PIC X(32) VALUE "NESTED                         R".
    05  FILLER PIC X(32) VALUE "NEXT                           R".
    05  FILLER PIC X(32) VALUE "NO                             R".
    05  FILLER PIC X(32) VALUE "NOT                            R".
    05  FILLER PIC X(32) VALUE "NULL                           F".
    05  FILLER PIC X(32) VALUE "NULLS                          F".
    05  FILLER PIC X(32) VALUE "NUMBER                         R".
    05  FILLER PIC X(32) VALUE "NUMERIC                        R".
    05  FILLER PIC X(32) VALUE "NUMERIC-EDITED                 R".
    05  FILLER PIC X(32) VALUE "OBJECT                         R".
    05  FILLER PIC X(32) VALUE "OBJECT-COMPUTER                R".
    05  FILLER PIC X(32) VALUE "OBJECT-REFERENCE               R".
    05  FILLER PIC X(32) VALUE "OCCURS                         R".
    05  FILLER PIC X(32) VALUE "OF                             R".
    05  FILLER PIC X(32) VALUE "OFF                            R".
    05  FILLER PIC X(32) VALUE "OMITTED                        R".
    05  FILLER PIC X(32) VALUE "ON                             R".
    05  FILLER PIC X(32) VALUE "OPEN                           V".
    05  FILLER PIC X(32) VALUE "OPTIONAL                       R".
    05  FILLER PIC X(32) VALUE "OPTIONS                        R".
    05  FILLER PIC X(32) VALUE "OR                             R".
    05  FILLER PIC X(32) VALUE "ORDER                          R".
    05  FILLER PIC X(32) VALUE "ORGANIZATION                   R".
    05  FILLER PIC X(32) VALUE "OTHER                          R".
    05  FILLER PIC X(32) VALUE "OUTPUT                         R".
    05  FILLER PIC X(32) VALUE "OVERFLOW                       R".
    05  FILLER PIC X(32) VALUE "OVERRIDE                       R".
    05  FILLER PIC X(32) VALUE "PACKED-DECIMAL                 R".
    05  FILLER PIC X(32) VALUE "PADDING                        R".
    05  FILLER PIC X(32) VALUE "PAGE                           R".
    05  FILLER PIC X(32) VALUE "PAGE-COUNTER                   R".
    05  FILLER PIC X(32) VALUE "PARAGRAPH                      R".
    05  FILLER PIC X(32) VALUE "PERFORM                        V".
    05  FILLER PIC X(32) VALUE "PF                             R".
    05  FILLER PIC X(32) VALUE "PH                             R".
    05  FILLER PIC X(32) VALUE "PIC                            R".
    05  FILLER PIC X(32) VALUE "PICTURE                        R".
    05  FILLER PIC X(32) VALUE "PLUS                           R".
    05  FILLER PIC X(32) VALUE "POINTER                        R".
    05  FILLER PIC X(32) VALUE "POSITION                       R".
    05  FILLER PIC X(32) VALUE "POSITIVE                       R".
    05  FILLER PIC X(32) VALUE "PRESENT                        R".
    05  FILLER PIC X(32) VALUE "PRINTING                       R".
    05  FILLER PIC X(32) VALUE "PROCEDURE                      R".
    05  FILLER PIC X(32) VALUE "PROCEDURE-POINTER              R".
    05  FILLER PIC X(32) VALUE "PROCEDURES                     R".
    05  FILLER PIC X(32) VALUE "PROCEED                        R".
    05  FILLER PIC X(32) VALUE "PROGRAM                        R".
    05  FILLER PIC X(32) VALUE "PROGRAM-ID                     R".
    05  FILLER PIC X(32) VALUE "PROGRAM-POINTER                R".
    05  FILLER PIC X(32) VALUE "PROPERTY                       R".
    05  FILLER PIC X(32) VALUE "PROTOTYPE                      R".
    05  FILLER PIC X(32) VALUE "PURGE                          V".
    05  FILLER PIC X(32) VALUE "QUEUE                          R".
    05  FILLER PIC X(32) VALUE "QUOTE                          F".
    05  FILLER PIC X(32) VALUE "QUOTES                         F".
    05  FILLER PIC X(32) VALUE "RAISE                          V".
    05  FILLER PIC X(32) VALUE "RD                             R".
    05  FILLER PIC X(32) VALUE "READ                           V".
    05  FILLER PIC X(32) VALUE "RECEIVE                        V".
    05  FILLER PIC X(32) VALUE "RECORD                         R".
    05  FILLER PIC X(32) VALUE "RECORDING                      R".
    05  FILLER PIC X(32) VALUE "RECORDS                        R".
    05  FILLER PIC X(32) VALUE "RECURSIVE                      R".
    05  FILLER PIC X(32) VALUE "REDEFINES                      R".
    05  FILLER PIC X(32) VALUE "REEL                           R".
    05  FILLER PIC X(32) VALUE "REFERENCE                      R".
    05  FILLER PIC X(32) VALUE "REFERENCES                     R".
    05  FILLER PIC X(32) VALUE "RELATIVE                       R".
    05  FILLER PIC X(32) VALUE "RELEASE                        V".
    05  FILLER PIC X(32) VALUE "REMAINDER                      R".
    05  FILLER PIC X(32) VALUE "REMARKS                        R".
    05  FILLER PIC X(32) VALUE "REMOVAL                        R".
    05  FILLER PIC X(32) VALUE "RENAMES                        R".
    05  FILLER PIC X(32) VALUE "REPLACE                        R".
    05  FILLER PIC X(32) VALUE "REPLACING                      R".
    05  FILLER PIC X(32) VALUE "REPORT                         R".
    05  FILLER PIC X(32) VALUE "REPORTING                      R".
    05  FILLER PIC X(32) VALUE "REPORTS                        R".
    05  FILLER PIC X(32) VALUE "REPOSITORY                     R".
    05  FILLER PIC X(32) VALUE "RESERVE                        R".
    05  FILLER PIC X(32) VALUE "RESUME                         V".
    05  FILLER PIC X(32) VALUE "RETURN                         V".
    05  FILLER PIC X(32) VALUE "RETURN-CODE                    S".
    05  FILLER PIC X(32) VALUE "RETURNING                      R".
    05  FILLER PIC X(32) VALUE "REVERSED                       R".
    05  FILLER PIC X(32) VALUE "REWIND                         R".
    05  FILLER PIC X(32) VALUE "REWRITE                        V".
    05  FILLER PIC X(32) VALUE "RF                             R".
    05  FILLER PIC X(32) VALUE "RH                             R".
    05  FILLER PIC X(32) VALUE "RIGHT                          R".
    05  FILLER PIC X(32) VALUE "ROLLBACK                       V".
    05  FILLER PIC X(32) VALUE "ROUNDED                        R".
    05  FILLER PIC X(32) VALUE "RUN                            R".
    05  FILLER PIC X(32) VALUE "SAME                           R".
    05  FILLER PIC X(32) VALUE "SCREEN                         R".
    05  FILLER PIC X(32) VALUE "SD                             R".
    05  FILLER PIC X(32) VALUE "SEARCH                         V".
    05  FILLER PIC X(32) VALUE "SECTION                        R".
    05  FILLER PIC X(32) VALUE "SECURE                         R".
    05  FILLER PIC X(32) VALUE "SECURITY                       R".
    05  FILLER PIC X(32) VALUE "SEGMENT                        R".
    05  FILLER PIC X(32) VALUE "SELECT                         R".
    05  FILLER PIC X(32) VALUE "SELF                           R".
    05  FILLER PIC X(32) VALUE "SEND                           V".
    05  FILLER PIC X(32) VALUE "SENTENCE                       R".
    05  FILLER PIC X(32) VALUE "SEPARATE                       R".
    05  FILLER PIC X(32) VALUE "SEQUENCE                       R".
    05  FILLER PIC X(32) VALUE "SEQUENTIAL                     R".
    05  FILLER PIC X(32) VALUE "SET                            V".
    05  FILLER PIC X(32) VALUE "SHARING                        R".
    05  FILLER PIC X(32) VALUE "SIGN                           R".
    05  FILLER PIC X(32) VALUE "SIZE                           R".
    05  FILLER PIC X(32) VALUE "SORT                           V".
    05  FILLER PIC X(32) VALUE "SORT-RETURN                    S".
    05  FILLER PIC X(32) VALUE "SOURCE                         R".
    05  FILLER PIC X(32) VALUE "SOURCE-COMPUTER                R".
    05  FILLER PIC X(32) VALUE "SOURCES                        R".
    05  FILLER PIC X(32) VALUE "SPACE                          F".
    05  FILLER PIC X(32) VALUE "SPACES                         F".
    05  FILLER PIC X(32) VALUE "SPECIAL-NAMES                  R".
    05  FILLER PIC X(32) VALUE "STANDARD                       R".
    05  FILLER PIC X(32) VALUE "STANDARD-1                     R".
    05  FILLER PIC X(32) VALUE "STANDARD-2                     R".
    05  FILLER PIC X(32) VALUE "START                          V".
    05  FILLER PIC X(32) VALUE "STATUS                         R".
    05  FILLER PIC X(32) VALUE "STOP                           V".
    05  FILLER PIC X(32) VALUE "STRING                         V".
    05  FILLER PIC X(32) VALUE "SUBTRACT                       V".
    05  FILLER PIC X(32) VALUE "SUM                            R".
    05  FILLER PIC X(32) VALUE "SUPER                          R".
    05  FILLER PIC X(32) VALUE "SUPPRESS                       V".
    05  FILLER PIC X(32) VALUE "SYMBOLIC                       R".
    05  FILLER PIC X(32) VALUE "SYNC                           R".
    05  FILLER PIC X(32) VALUE "SYNCHRONIZED                   R".
    05  FILLER PIC X(32) VALUE "SYSTEM-DEFAULT                 R".
    05  FILLER PIC X(32) VALUE "TABLE                          R".
    05  FILLER PIC X(32) VALUE "TALLY                          S".
    05  FILLER PIC X(32) VALUE "TALLYING                       R".
    05  FILLER PIC X(32) VALUE "TERMINAL                       R".
    05  FILLER PIC X(32) VALUE "TERMINATE                      V".
    05  FILLER PIC X(32) VALUE "TEST                           R".
    05  FILLER PIC X(32) VALUE "TEXT                           R".
    05  FILLER PIC X(32) VALUE "THAN                           R".
    05  FILLER PIC X(32) VALUE "THEN                           R".
    05  FILLER PIC X(32) VALUE "THROUGH                        R".
    05  FILLER PIC X(32) VALUE "THRU                           R".
    05  FILLER PIC X(32) VALUE "TIME                           R".
    05  FILLER PIC X(32) VALUE "TIMES                          R".
    05  FILLER PIC X(32) VALUE "TO                             R".
    05  FILLER PIC X(32) VALUE "TOP                            R".
    05  FILLER PIC X(32) VALUE "TRAILING                       R".
    05  FILLER PIC X(32) VALUE "TRANSFORM                      V".
    05  FILLER PIC X(32) VALUE "TRUE                           R".
    05  FILLER PIC X(32) VALUE "TYPE                           R".
    05  FILLER PIC X(32) VALUE "TYPEDEF                        R".
    05  FILLER PIC X(32) VALUE "UNIT                           R".
    05  FILLER PIC X(32) VALUE "UNIVERSAL                      R".
    05  FILLER PIC X(32) VALUE "UNLOCK                         V".
    05  FILLER PIC X(32) VALUE "UNSTRING                       V".
    05  FILLER PIC X(32) VALUE "UNTIL                          R".
    05  FILLER PIC X(32) VALUE "UP                             R".
    05  FILLER PIC X(32) VALUE "UPON                           R".
    05  FILLER PIC X(32) VALUE "USAGE                          R".
    05  FILLER PIC X(32) VALUE "USE                            R".
    05  FILLER PIC X(32) VALUE "USER-DEFAULT                   R".
    05  FILLER PIC X(32) VALUE "USING                          R".
    05  FILLER PIC X(32) VALUE "VALID                          R".
    05  FILLER PIC X(32) VALUE "VALIDATE                       V".
    05  FILLER PIC X(32) VALUE "VALUE                          R".
    05  FILLER PIC X(32) VALUE "VALUES                         R".
    05  FILLER PIC X(32) VALUE "VARYING                        R".
    05  FILLER PIC X(32) VALUE "WHEN                           R".
    05  FILLER PIC X(32) VALUE "WHEN-COMPILED                  S".
    05  FILLER PIC X(32) VALUE "WITH                           R".
    05  FILLER PIC X(32) VALUE "WORKING-STORAGE                R".
    05  FILLER PIC X(32) VALUE "WRITE                          V".
    05  FILLER PIC X(32) VALUE "XML                            V".
    05  FILLER PIC X(32) VALUE "ZERO                           F".
    05  FILLER PIC X(32) VALUE "ZEROES                         F".
    05  FILLER PIC X(32) VALUE "ZEROS                          F".
01  WS-KEYWORD-TABLE REDEFINES WS-KEYWORD-VALUES.
    05  WS-KEYWORD              OCCURS KW-COUNT TIMES
                                ASCENDING KEY IS KW-WORD
                                INDEXED BY KW-INDEX.
        10  KW-WORD             PIC X(31).
        10  KW-KIND             PIC X.
