IDENTIFICATION DIVISION.
PROGRAM-ID. TWICE.
PROCEDURE DIVISION.
FIRST-STEP.
    GO TO LAST-STEP.
SECOND-STEP.
    GO TO LAST-STEP.
LAST-STEP.
    STOP RUN.
