       >>SOURCE FORMAT COBOLX
 IDENTIFICATION DIVISION.
 PROGRAM-ID. CBLXFMT.
DDISPLAY "SHOWN WHEN DEBUGGING"
* A comment line, and a page eject:
/
 PROCEDURE DIVISION.
     DISPLAY "FIRST PART
-           " AND SECOND PART"
     GOBACK.
