000100 IDENTIFICATION DIVISION.                                         PAYCALC
000200 PROGRAM-ID. PAYCALC.                                             PAYCALC
000300*THIS PROGRAM COMPUTES GROSS PAY.
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600 01  WS-HOURS              PIC 9(3)V9 VALUE 0.
000700 01  WS-BANNER             PIC X(60) VALUE "GROSS PAY REPORT FOR
000800-    "THE CURRENT PERIOD".

000900/
001000 PROCEDURE DIVISION.
001100 MAIN-PARA.
001200     MOVE 40 TO WS-HOURS   *> standard week
001300D    DISPLAY "HOURS: " WS-HOURS
001400     DISPLAY WS-BANNER
001500     STOP RUN.
