000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. SWITCHER.
000300 >>SOURCE FORMAT IS FREE
PROCEDURE DIVISION.
DISPLAY "NOW FREE".
>>SOURCE FORMAT IS FIXED
000400     STOP RUN.
000500 >>SOURCE FORMAT COBOLX
