       IDENTIFICATION DIVISION.
       PROGRAM-ID. VARFMT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-RESULT-OF-THE-COMPUTATION PIC 9(4) VALUE 0.
       PROCEDURE DIVISION.    MOVE 1                                                TO WS-RESULT-OF-THE-COMPUTATION
           DISPLAY WS-RESULT-OF-THE-COMPUTATION
           GOBACK.
