*> FUNCTION ALL INTRINSIC in the REPOSITORY lets a program name
*> intrinsic functions without FUNCTION; FUNCTION name INTRINSIC lets it
*> name those it lists. Other programs still need FUNCTION.
IDENTIFICATION DIVISION.
PROGRAM-ID. ALL-OF-THEM.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
REPOSITORY.
    FUNCTION ALL INTRINSIC.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  Z                   PIC 99V99.
PROCEDURE DIVISION.
    MOVE PI TO Z
    MOVE SQRT (Z) TO Z
    GOBACK.
END PROGRAM ALL-OF-THEM.
IDENTIFICATION DIVISION.
PROGRAM-ID. SOME-OF-THEM.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
REPOSITORY.
    FUNCTION PI E INTRINSIC.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  Z                   PIC 99V99.
PROCEDURE DIVISION.
    MOVE PI TO Z
    MOVE SQRT TO Z
    GOBACK.
END PROGRAM SOME-OF-THEM.
