*> How names in the procedure division resolve.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
    SYSERR IS ERROR-DEVICE.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT IN-FILE ASSIGN TO "in.dat".
DATA DIVISION.
FILE SECTION.
FD  IN-FILE.
01  IN-REC.
    05  CUST-ID         PIC 9(6).
WORKING-STORAGE SECTION.
01  CUSTOMER.
    05  CUST-ID         PIC 9(6).
    05  CUST-NAME       PIC X(30).
01  ORDER-REC.
    05  CUST-ID         PIC 9(6).
01  TOTALS.
    05  AMOUNT          PIC 9(7) OCCURS 12 TIMES INDEXED BY MONTH-IX.
01  I                   PIC 9(4).
PROCEDURE DIVISION.
MAIN-LINE.
    MOVE CUST-ID OF CUSTOMER TO CUST-ID IN ORDER-REC
    MOVE CUST-ID OF IN-FILE TO CUST-ID OF CUSTOMER
    MOVE CUST-ID TO I
    MOVE AMOUNT (I) TO AMOUNT(MONTH-IX)
    DISPLAY CUST-NAME(1:10) UPON CONSOLE
    DISPLAY FUNCTION UPPER-CASE(CUST-NAME) UPON ERROR-DEVICE
    MOVE NO-SUCH-ITEM TO I
    SORT IN-FILE ON ASCENDING KEY CUST-ID OF IN-REC
        INPUT PROCEDURE IS MAIN-LINE GIVING IN-FILE
    STOP RUN.
