*> Nested and sibling programs.
IDENTIFICATION DIVISION.
PROGRAM-ID. OUTER.
PROCEDURE DIVISION.
    CALL "INNER"
    GOBACK.
IDENTIFICATION DIVISION.
PROGRAM-ID. INNER IS COMMON.
PROCEDURE DIVISION.
    EXIT PROGRAM.
END PROGRAM INNER.
END PROGRAM OUTER.
IDENTIFICATION DIVISION.
PROGRAM-ID. SIBLING.
PROCEDURE DIVISION.
    STOP RUN.
IDENTIFICATION DIVISION.
PROGRAM-ID. UNCLOSED-NESTED.
PROCEDURE DIVISION.
    GOBACK.
