*> RECEIVE of the communication module takes NO DATA and WITH DATA
*> phrases, which hold statements as AT END does; WITH NO ADVANCING
*> of DISPLAY is not one.
IDENTIFICATION DIVISION.
PROGRAM-ID. RECVPH.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  MSG                 PIC X(80).
01  POLLS               PIC 9(4).
PROCEDURE DIVISION.
POLL.
    RECEIVE IN-QUEUE MESSAGE INTO MSG
        NO DATA ADD 1 TO POLLS GO TO POLL.
    RECEIVE IN-QUEUE SEGMENT INTO MSG
        NO DATA
            DISPLAY "EMPTY" WITH NO ADVANCING
        WITH DATA
            DISPLAY MSG
    END-RECEIVE
    STOP RUN.
