*> A paragraph that is performed and also fallen into.
PROCEDURE DIVISION.
MAIN-LINE.
    PERFORM CALC
    DISPLAY "CALCULATED".
CALC.
    ADD 1 TO TOTAL.
FINISH.
    STOP RUN.
