*> REDEFINES items larger than what they redefine.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  REC.
    05  CODE-NUM        PIC 9(4).
    05  CODE-TEXT REDEFINES CODE-NUM PIC X(6).
    05  CODE-SAME REDEFINES CODE-NUM PIC X(4).
01  WHOLE-RECORD        PIC X(10).
01  BIGGER-RECORD REDEFINES WHOLE-RECORD PIC X(20).
PROCEDURE DIVISION.
    DISPLAY REC WHOLE-RECORD BIGGER-RECORD
    STOP RUN.
