*> GO TO and ALTER.
PROCEDURE DIVISION.
MAIN-LINE.
    ALTER SWITCH-PARA TO PROCEED TO DONE
    GO TO SWITCH-PARA.
SWITCH-PARA.
    GO TO START-PARA.
START-PARA.
    DISPLAY "STARTED".
DONE.
    STOP RUN.
