000100 01  MSG VALUE "HELLO
000200-    "WORLD".
000300 01  LONG-NAME-PART-
000400*    A COMMENT BETWEEN A LINE AND ITS CONTINUATION
000500-    TWO PIC X.
000600D    DISPLAY "DEBUG".
000700     MOVE 1 TO X.
